const PCT_8TIER = [6.7961, 7.7670, 20.3883, 24.2718, 17.4757, 14.5631, 5.8252, 2.9126]
const CRIT_8TIER = [23.3333, 23.3333, 23.3333, 8.0, 8.0, 8.0, 3.0, 3.0]

export const SUB_STAT_PROBABILITIES = {
  '크리티컬%': CRIT_8TIER,
  '크리티컬 피해%': CRIT_8TIER,
  '공격력%': PCT_8TIER,
  '공명 효율%': PCT_8TIER,
  '공명 해방 피해 보너스%': PCT_8TIER,
  '강공격 피해 보너스%': PCT_8TIER,
  '공명 스킬 피해 보너스%': PCT_8TIER,
  '일반 공격 피해 보너스%': PCT_8TIER,
  '방어력%': PCT_8TIER,
  'HP%': PCT_8TIER,
  '공격력': [6.7961, 52.4272, 37.8641, 2.9126, 0],
  'HP': PCT_8TIER,
  '방어력': [14.5631, 44.6602, 32.0388, 8.7379, 0],
}
